app/controllers/api/v1/events_controller.rb

SELECT "events".* FROM "events"
---
      def index
        render json: Event.all

INSERT INTO "events" ("title", "created_at", "updated_at") VALUES (?, ?, ?)  [["title", "myNewEvent"], ["created_at", "2018-06-22 22:17:46.746151"], ["updated_at", "2018-06-22 22:17:46.746151"]]
---
      def create
        @event = Event.new(event_params)
        if @event.save

UPDATE "events" SET "title" = ?, "updated_at" = ? WHERE "events"."id" = ?  [["title", "my new even flow"], ["updated_at", "2018-06-23 13:34:06.657305"], ["id", 1]]
---
      def update
        if @event.update(event_params)

DELETE FROM "events" WHERE "events"."id" = ?  [["id", 2]]
---
      def destroy
        if @event.destroy